pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fw429.h
#define OUTMOD_0               (0x0000)       /* PWM output mode: 0 - output only */
#define OUTMOD_1               (0x0020)       /* PWM output mode: 1 - set */
#define OUTMOD_2               (0x0040)       /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3               (0x0060)       /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4               (0x0080)       /* PWM output mode: 4 - toggle */
#define OUTMOD_5               (0x00A0)       /* PWM output mode: 5 - Reset */
#define OUTMOD_6               (0x00C0)       /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7               (0x00E0)       /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0                 (0x0000)       /* Capture input select: 0 - CCIxA */
#define CCIS_1                 (0x1000)       /* Capture input select: 1 - CCIxB */
#define CCIS_2                 (0x2000)       /* Capture input select: 2 - GND */
#define CCIS_3                 (0x3000)       /* Capture input select: 3 - Vcc */
#define CM_0                   (0x0000)       /* Capture mode: 0 - disabled */
#define CM_1                   (0x4000)       /* Capture mode: 1 - pos. edge */
#define CM_2                   (0x8000)       /* Capture mode: 1 - neg. edge */
#define CM_3                   (0xC000)       /* Capture mode: 1 - both edges */

/* T0_A3IV Definitions */
#define TA0IV_NONE             (0x0000)       /* No Interrupt pending */
#define TA0IV_TACCR1           (0x0002)       /* TA0CCR1_CCIFG */
#define TA0IV_TACCR2           (0x0004)       /* TA0CCR2_CCIFG */
#define TA0IV_6                (0x0006)       /* Reserved */
#define TA0IV_8                (0x0008)       /* Reserved */
#define TA0IV_TAIFG            (0x000A)       /* TA0IFG */

/************************************************************
* Timer1_A5
************************************************************/
#define __MSP430_HAS_T1A5__                   /* Definition to show that Module is available */

sfr_w(TA1IV);                                 /* Timer1_A5 Interrupt Vector Word */
sfr_w(TA1CTL);                                /* Timer1_A5 Control */
sfr_w(TA1CCTL0);                              /* Timer1_A5 Capture/Compare Control 0 */
sfr_w(TA1CCTL1);                              /* Timer1_A5 Capture/Compare Control 1 */
sfr_w(TA1CCTL2);                              /* Timer1_A5 Capture/Compare Control 2 */
sfr_w(TA1CCTL3);                              /* Timer1_A5 Capture/Compare Control 3 */
sfr_w(TA1CCTL4);                              /* Timer1_A5 Capture/Compare Control 4 */
sfr_w(TA1R);                                  /* Timer1_A5 Counter Register */
sfr_w(TA1CCR0);                               /* Timer1_A5 Capture/Compare 0 */
sfr_w(TA1CCR1);                               /* Timer1_A5 Capture/Compare 1 */
sfr_w(TA1CCR2);                               /* Timer1_A5 Capture/Compare 2 */
sfr_w(TA1CCR3);                               /* Timer1_A5 Capture/Compare 3 */
sfr_w(TA1CCR4);                               /* Timer1_A5 Capture/Compare 4 */

/* Bits are already defined within the Timer0_Ax */

/* T1_A5IV Definitions */
#define TA1IV_NONE             (0x0000)       /* No Interrupt pending */
#define TA1IV_TACCR1           (0x0002)       /* TA1CCR1_CCIFG */
#define TA1IV_TACCR2           (0x0004)       /* TA1CCR2_CCIFG */
#define TA1IV_TACCR3           (0x0006)       /* TA1CCR3_CCIFG */
#define TA1IV_TACCR4           (0x0008)       /* TA1CCR4_CCIFG */
#define TA1IV_TAIFG            (0x000A)       /* TA1IFG */

/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__                  /* Definition to show that Module is available */

sfr_w(FCTL1);                                 /* FLASH Control 1 */
sfr_w(FCTL2);                                 /* FLASH Control 2 */
sfr_w(FCTL3);                                 /* FLASH Control 3 */

#define FRKEY                  (0x9600)       /* Flash key returned by read */
#define FWKEY                  (0xA500)       /* Flash key for write */
#define FXKEY                  (0x3300)       /* for use with XOR instruction */

#define ERASE                  (0x0002)       /* Enable bit for Flash segment erase */
#define MERAS                  (0x0004)       /* Enable bit for Flash mass erase */
#define WRT                    (0x0040)       /* Enable bit for Flash write */
#define BLKWRT                 (0x0080)       /* Enable bit for Flash segment write */
#define SEGWRT                 (0x0080)       /* old definition */ /* Enable bit for Flash segment write */

#define FN0                    (0x0001)       /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to: */
#define FN1                    (0x0002)       /*  32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 */
#ifndef FN2
#define FN2                    (0x0004)
#endif
#ifndef FN3
#define FN3                    (0x0008)
#endif
#ifndef FN4
#define FN4                    (0x0010)
#endif
#define FN5                    (0x0020)
#define FSSEL0                 (0x0040)       /* Flash clock select 0 */        /* to distinguish from USART SSELx */
#define FSSEL1                 (0x0080)       /* Flash clock select 1 */

#define FSSEL_0                (0x0000)       /* Flash clock select: 0 - ACLK */
#define FSSEL_1                (0x0040)       /* Flash clock select: 1 - MCLK */
#define FSSEL_2                (0x0080)       /* Flash clock select: 2 - SMCLK */
#define FSSEL_3                (0x00C0)       /* Flash clock select: 3 - SMCLK */

#define BUSY                   (0x0001)       /* Flash busy: 1 */
#define KEYV                   (0x0002)       /* Flash Key violation flag */
#define ACCVIFG                (0x0004)       /* Flash Access violation flag */
#define WAIT                   (0x0008)       /* Wait flag for segment write */
#define LOCK                   (0x0010)       /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                   (0x0020)       /* Flash Emergency Exit */

/************************************************************
* Comparator A
************************************************************/
#define __MSP430_HAS_COMPA__                  /* Definition to show that Module is available */

sfr_b(CACTL1);                                /* Comparator A Control 1 */
sfr_b(CACTL2);                                /* Comparator A Control 2 */
sfr_b(CAPD);                                  /* Comparator A Port Disable */

#define CAIFG                  (0x01)         /* Comp. A Interrupt Flag */
#define CAIE                   (0x02)         /* Comp. A Interrupt Enable */
#define CAIES                  (0x04)         /* Comp. A Int. Edge Select: 0:rising / 1:falling */
#define CAON                   (0x08)         /* Comp. A enable */
#define CAREF0                 (0x10)         /* Comp. A Internal Reference Select 0 */
#define CAREF1                 (0x20)         /* Comp. A Internal Reference Select 1 */
#define CARSEL                 (0x40)         /* Comp. A Internal Reference Enable */
#define CAEX                   (0x80)         /* Comp. A Exchange Inputs */

#define CAREF_0                (0x00)         /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1                (0x10)         /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2                (0x20)         /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3                (0x30)         /* Comp. A Int. Ref. Select 3 : Vt*/

#define CAOUT                  (0x01)         /* Comp. A Output */
#define CAF                    (0x02)         /* Comp. A Enable Output Filter */
#define P2CA0                  (0x04)         /* Comp. A Connect External Signal to CA0 : 1 */
#define P2CA1                  (0x08)         /* Comp. A Connect External Signal to CA1 : 1 */
#define CACTL24                (0x10)
#define CACTL25                (0x20)
#define CACTL26                (0x40)
#define CACTL27                (0x80)

#define CAPD0                  (0x01)         /* Comp. A Disable Input Buffer of Port Register .0 */
#define CAPD1                  (0x02)         /* Comp. A Disable Input Buffer of Port Register .1 */
#define CAPD2                  (0x04)         /* Comp. A Disable Input Buffer of Port Register .2 */
#define CAPD3                  (0x08)         /* Comp. A Disable Input Buffer of Port Register .3 */
#define CAPD4                  (0x10)         /* Comp. A Disable Input Buffer of Port Register .4 */
#define CAPD5                  (0x20)         /* Comp. A Disable Input Buffer of Port Register .5 */
#define CAPD6                  (0x40)         /* Comp. A Disable Input Buffer of Port Register .6 */
#define CAPD7                  (0x80)         /* Comp. A Disable Input Buffer of Port Register .7 */

/************************************************************
* Scan-I/F
************************************************************/
#define __MSP430_HAS_SCANIF__                 /* Definition to show that Module is available */

sfr_w(SIFDEBUG);                              /* SIF, Debug Register */
sfr_w(SIFCNT);                                /* SIF, Counter1/2 */
sfr_w(SIFPSMV);                               /* SIF, Processing State Machine */
sfr_w(SIFCTL1);                               /* SIF, Control Register 1 */
sfr_w(SIFCTL2);                               /* SIF, Control Register 2 */
sfr_w(SIFCTL3);                               /* SIF, Control Register 3 */
sfr_w(SIFCTL4);                               /* SIF, Control Register 4 */
sfr_w(SIFCTL5);                               /* SIF, Control Register 5 */
#define SIFDACR_               (0x01C0)       /* SIF, Digital to Analog Conv. 0 */
#ifndef __STDC__
#define SIFDACR                (SIFDACR_)     /* SIF, Digital to Analog Conv. Memory (for assembler) */
#else
#define SIFDACR                ((unsigned     int*) SIFDACR_) /* SIF, Digital to Analog Conv. Memory (for C) */
#endif
sfr_w(SIFDACR0);                              /* SIF, Digital to Analog Conv. 0 */
sfr_w(SIFDACR1);                              /* SIF, Digital to Analog Conv. 1 */
sfr_w(SIFDACR2);                              /* SIF, Digital to Analog Conv. 2 */
sfr_w(SIFDACR3);                              /* SIF, Digital to Analog Conv. 3 */
sfr_w(SIFDACR4);                              /* SIF, Digital to Analog Conv. 4 */
sfr_w(SIFDACR5);                              /* SIF, Digital to Analog Conv. 5 */
sfr_w(SIFDACR6);                              /* SIF, Digital to Analog Conv. 6 */
sfr_w(SIFDACR7);                              /* SIF, Digital to Analog Conv. 7 */
#define SIFTSM_                (0x01D0)       /* SIF, Timing State Machine 0 */
#ifndef __STDC__
#define SIFTSM                 (SIFTSM_)      /* SIF, Timing State Machine (for assembler) */
#else
#define SIFTSM                 ((unsigned     int*) SIFTSM_) /* SIF, Timing State Machine (for C) */
#endif
sfr_w(SIFTSM0);                               /* SIF, Timing State Machine 0 */
sfr_w(SIFTSM1);                               /* SIF, Timing State Machine 1 */
sfr_w(SIFTSM2);                               /* SIF, Timing State Machine 2 */
sfr_w(SIFTSM3);                               /* SIF, Timing State Machine 3 */
sfr_w(SIFTSM4);                               /* SIF, Timing State Machine 4 */
sfr_w(SIFTSM5);                               /* SIF, Timing State Machine 5 */
sfr_w(SIFTSM6);                               /* SIF, Timing State Machine 6 */
sfr_w(SIFTSM7);                               /* SIF, Timing State Machine 7 */
sfr_w(SIFTSM8);                               /* SIF, Timing State Machine 8 */
sfr_w(SIFTSM9);                               /* SIF, Timing State Machine 9 */
sfr_w(SIFTSM10);                              /* SIF, Timing State Machine 10 */
sfr_w(SIFTSM11);                              /* SIF, Timing State Machine 11 */
sfr_w(SIFTSM12);                              /* SIF, Timing State Machine 12 */
sfr_w(SIFTSM13);                              /* SIF, Timing State Machine 13 */
sfr_w(SIFTSM14);                              /* SIF, Timing State Machine 14 */
sfr_w(SIFTSM15);                              /* SIF, Timing State Machine 15 */
sfr_w(SIFTSM16);                              /* SIF, Timing State Machine 16 */
sfr_w(SIFTSM17);                              /* SIF, Timing State Machine 17 */
sfr_w(SIFTSM18);                              /* SIF, Timing State Machine 18 */
sfr_w(SIFTSM19);                              /* SIF, Timing State Machine 19 */
sfr_w(SIFTSM20);                              /* SIF, Timing State Machine 20 */
sfr_w(SIFTSM21);                              /* SIF, Timing State Machine 21 */
sfr_w(SIFTSM22);                              /* SIF, Timing State Machine 22 */
sfr_w(SIFTSM23);                              /* SIF, Timing State Machine 23 */

/* SIFCTL1 */
#define SIFEN                  (0x0001)       /* SIF Enable */
#define SIFTESTD               (0x0002)       /* SIF 0:Normal / 1:Test Mode */
#define SIFIFG0                (0x0004)       /* SIF Interrupt Flag 0 */
#define SIFIFG1                (0x0008)       /* SIF Interrupt Flag 1 */
#define SIFIFG2                (0x0010)       /* SIF Interrupt Flag 2 */
#define SIFIFG3                (0x0020)       /* SIF Interrupt Flag 3 */
#define SIFIFG4                (0x0040)       /* SIF Interrupt Flag 4 */
#define SIFIFG5                (0x0080)       /* SIF Interrupt Flag 5 */
#define SIFIFG6                (0x0100)       /* SIF Interrupt Flag 6 */
#define SIFIE0                 (0x0200)       /* SIF Interrupt Enable 0 */
#define SIFIE1                 (0x0400)       /* SIF Interrupt Enable 1 */
#define SIFIE2                 (0x0800)       /* SIF Interrupt Enable 2 */
#define SIFIE3                 (0x1000)       /* SIF Interrupt Enable 3 */
#define SIFIE4                 (0x2000)       /* SIF Interrupt Enable 4 */
#define SIFIE5                 (0x4000)       /* SIF Interrupt Enable 5 */
#define SIFIE6                 (0x8000)       /* SIF Interrupt Enable 6 */

/* SIFCTL2 */
#define SIFTCH0OUT             (0x0001)       /* SIF TCH0 result */
#define SIFTCH1OUT             (0x0002)       /* SIF TCH1 result */
#define SIFTCH00               (0x0004)       /* SIF 1. Channel select 0 */
#define SIFTCH01               (0x0008)       /* SIF 1. Channel select 1 */
#define SIFTCH10               (0x0010)       /* SIF 2. Channel select 0 */
#define SIFTCH11               (0x0020)       /* SIF 2. Channel select 1 */
#define SIFTEN                 (0x0040)       /* SIF Enable Transistors */
#define SIFSH                  (0x0080)       /* SIF Sample on/off */
#define SIFVCC2                (0x0100)       /* SIF VCC/2 Generator off/on */
#define SIFVSS                 (0x0200)       /* SIF Select Terminal for sample Cap. */
#define SIFCACI3               (0x0400)       /* SIF Selection of SIFCI3 */
#define SIFCISEL               (0x0800)       /* SIF Comparator Input Select */
#define SIFCAX                 (0x1000)       /* SIF Select CA Source */
#define SIFCAINV               (0x2000)       /* SIF Invert CA Output 0:off/1:on */
#define SIFCAON                (0x4000)       /* SIF Switch CA on */
#define SIFDACON               (0x8000)       /* SIF Switch DAC on */

/* SIFCTL3 */
#define SIF0OUT                (0x0001)       /* SIF Sensor 0 Out */
#define SIF1OUT                (0x0002)       /* SIF Sensor 1 Out */
#define SIF2OUT                (0x0004)       /* SIF Sensor 2 Out */
#define SIF3OUT                (0x0008)       /* SIF Sensor 3 Out */
#define SIFIFGSET0             (0x0010)       /* SIF SIFIFG0 level select */
#define SIFIFGSET1             (0x0020)       /* SIF SIFIFG1 level select */
#define SIFIFGSET2             (0x0040)       /* SIF SIFIFG2 level select */
#define SIFCS                  (0x0080)       /* SIF Capture Select */
#define SIFIS10                (0x0100)       /* SIF SIFIFG3 Int.Flag Source 0 */
#define SIFIS11                (0x0200)       /* SIF SIFIFG3 Int.Flag Source 1 */
#define SIFIS20                (0x0400)       /* SIF SIFIFG4 Int.Flag Source 0 */
#define SIFIS21                (0x0800)       /* SIF SIFIFG4 Int.Flag Source 1 */
#define SIFS10                 (0x1000)       /* SIF S1 Source Select 0 */
#define SIFS11                 (0x2000)       /* SIF S1 Source Select 1 */
#define SIFS20                 (0x4000)       /* SIF S2 Source Select 0 */
#define SIFS21                 (0x8000)       /* SIF S2 Source Select 1 */

#define SIFIS1_0               (0x0000)       /* SIF SIFIFG3 set with each count of SIFCNT1 */
#define SIFIS1_1               (0x0100)       /* SIF SIFIFG3 set if (SIFCNT1 mod  4)=0 */
#define SIFIS1_2               (0x0200)       /* SIF SIFIFG3 set if (SIFCNT1 mod 64)=0 */
#define SIFIS1_3               (0x0300)       /* SIF SIFIFG3 set if SIFCNT1 rolls over */
#define SIFIS2_0               (0x0000)       /* SIF SIFIFG4 set with each count of SIFCNT2 */
#define SIFIS2_1               (0x0400)       /* SIF SIFIFG4 set if (SIFCNT2 mod  4)=0 */
#define SIFIS2_2               (0x0800)       /* SIF SIFIFG4 set if (SIFCNT2 mod 64)=0 */
#define SIFIS2_3               (0x0C00)       /* SIF SIFIFG4 set if SIFCNT2 rolls over */
#define SIFS1_0                (0x0000)       /* SIF S1 Source : SIF0OUT */
#define SIFS1_1                (0x1000)       /* SIF S1 Source : SIF1OUT */
#define SIFS1_2                (0x2000)       /* SIF S1 Source : SIF2OUT */
#define SIFS1_3                (0x3000)       /* SIF S1 Source : SIF3OUT */
#define SIFS2_0                (0x0000)       /* SIF S2 Source : SIF0OUT */
#define SIFS2_1                (0x4000)       /* SIF S2 Source : SIF1OUT */
#define SIFS2_2                (0x8000)       /* SIF S2 Source : SIF2OUT */
#define SIFS2_3                (0xC000)       /* SIF S2 Source : SIF3OUT */

/* SIFCTL4 */
#define SIFDIV10               (0x0001)       /* SIF Clock Divider 1.0 */
#define SIFDIV11               (0x0002)       /* SIF Clock Divider 1.1 */
#define SIFDIV20               (0x0004)       /* SIF Clock Divider 2.0 */
#define SIFDIV21               (0x0008)       /* SIF Clock Divider 2.1 */
#define SIFDIV3A0              (0x0010)       /* SIF Clock Divider 3.0 */
#define SIFDIV3A1              (0x0020)       /* SIF Clock Divider 3.1 */
#define SIFDIV3A2              (0x0040)       /* SIF Clock Divider 3.2 */
#define SIFDIV3B0              (0x0080)       /* SIF Clock Divider 3.3 */
#define SIFDIV3B1              (0x0100)       /* SIF Clock Divider 3.4 */
#define SIFDIV3B2              (0x0200)       /* SIF Clock Divider 3.5 */
#define SIFQ6EN                (0x0400)       /* SIF Feedback 6 Enable */
#define SIFQ7EN                (0x0800)       /* SIF Feedback 7 Enable */
#define SIFCNT1ENP             (0x1000)       /* SIF Enable SIFCNT1 up count */
#define SIFCNT1ENM             (0x2000)       /* SIF Enable SIFCNT1 down count */
#define SIFCNT2EN              (0x4000)       /* SIF Enable SIFCNT2 count */
#define SIFCNTRST              (0x8000)       /* SIF Enable Counter Reset on Read */

